Revit 2027 API
WorksetId.Compare Method
Compares two WorksetIds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Compare(
	WorksetId id
)
Public Function Compare (
	id As WorksetId
) As Integer
public:
int Compare(
	WorksetId^ id
)
member Compare :
        id : WorksetId -> int
Parameters
id WorksetId
The WorksetId to be compared with this WorksetId.
Return Value
Int32
-1 if this WorksetId is less than id, 0 if equal, 1 if greater.
See Also
Reference
WorksetId Class
Autodesk.Revit.DB Namespace